#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.covid_tracker_ui will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "covid_tracker_ui"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod/*",
            ]

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_acm_certificate.covid_tracker_ui_alt_cert will be destroyed
  - resource "aws_acm_certificate" "covid_tracker_ui_alt_cert" {
      - arn                       = "arn:aws:acm:us-east-1:780046271874:certificate/e500f649-515c-4260-925d-45c8e416c77c" -> null
      - domain_name               = "trackncovph.jclarino.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "trackncovph.jclarino.com"
              - resource_record_name  = "_dc694037fd82f286e24d00e489329bc8.trackncovph.jclarino.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_9083c5f22b65ecb3394e65126c096ef4.auiqqraehs.acm-validations.aws."
            },
          - {
              - domain_name           = "covidtracker.ph"
              - resource_record_name  = "_3837677d614dfc3d31b1932900e95038.covidtracker.ph."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_fca24f2117848fb4d68b1cd3f5a72d49.auiqqraehs.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:780046271874:certificate/e500f649-515c-4260-925d-45c8e416c77c" -> null
      - subject_alternative_names = [
          - "covidtracker.ph",
        ] -> null
      - tags                      = {
          - "Environment" = "prod"
          - "Name"        = "Alternative Domain for Covid Tracker PH UI"
        } -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate.covid_tracker_ui_cert will be created
  + resource "aws_acm_certificate" "covid_tracker_ui_cert" {
      + arn                       = (known after apply)
      + domain_name               = "trackncovph.jclarino.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "covidtracker.ph",
        ]
      + tags                      = {
          + "Environment" = "prod"
          + "Name"        = "Alternative Domain for Covid Tracker PH UI"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_s3_bucket.covid_tracker_ui will be updated in-place
  ~ resource "aws_s3_bucket" "covid_tracker_ui" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::covid-tracker-ui-prod"
        bucket                      = "covid-tracker-ui-prod"
        bucket_domain_name          = "covid-tracker-ui-prod.s3.amazonaws.com"
        bucket_regional_domain_name = "covid-tracker-ui-prod.s3.ap-southeast-1.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3O0J2DXBE1FTB"
        id                          = "covid-tracker-ui-prod"
      ~ region                      = "ap-southeast-1" -> "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Name" = "covid-tracker-ui-prod"
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = true
            mfa_delete = false
        }
    }

  # aws_s3_bucket_policy.static_uis will be updated in-place
  ~ resource "aws_s3_bucket_policy" "static_uis" {
        bucket = "covid-tracker-ui-prod"
        id     = "covid-tracker-ui-prod"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5"
                        }
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5"
                        }
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>

*Workflow: `Infra Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `core`, Workspace: `default`*
